SELECT * FROM simplepostservice.post;
use simplepostservice;

INSERT INTO post (title, description)
VALUES ('금오공과대학교 컴퓨터공학과 졸업작품 발표회 개최', '최근 금오공과대학교 컴퓨터공학과에서 졸업작품 발표회가 개최되었습니다. 학생들은 다양한 주제로 프로젝트를 진행했으며, 우수 작품에 대해서는 상을 수여했습니다.'),
       ('금오공과대학교 대학원 신입생 모집 공고', '금오공과대학교 대학원에서는 새 학기 신입생 모집을 진행하고 있습니다. 지원 자격과 방법 등에 대해서는 대학 홈페이지에서 확인해주세요.'),
       ('금오공과대학교 산학협력단, AI 연구 센터 설립', '금오공과대학교 산학협력단은 최근 인공지능 분야에서 전문적인 연구를 진행하기 위해 AI 연구 센터를 설립하였습니다. 이를 통해 대학과 산업체 간의 협력이 강화될 것으로 기대됩니다.'),
       ('금오공과대학교 전자공학과, 로봇 공모전 수상', '금오공과대학교 전자공학과 학생들이 참여한 로봇 공모전에서 우수한 성적을 거두었습니다. 학생들은 협업을 통해 창의적인 로봇을 개발하였으며, 이를 통해 전공 실력을 향상시켰습니다.'),
       ('금오공과대학교 인문사회과학대학, 교내 대외협력 업무 추진', '금오공과대학교 인문사회과학대학은 다양한 대외협력 업무를 추진하고 있습니다. 이를 통해 학생들의 실무 경험을 쌓고, 산업체와의 연계를 강화하고자 합니다.'),
       ('금오공과대학교 제2회 창의융합 아이디어 공모전 개최', '금오공과대학교에서는 제2회 창의융합 아이디어 공모전을 개최합니다. 학생들은 혁신적인 아이디어를 제출하며, 우수 작품에 대해서는 특전 혜택을 제공합니다.'),
       ('금오공과대학교 컴퓨터공학과 졸업작품 발표회 개최', '최근 금오공과대학교 컴퓨터공학과에서 졸업작품 발표회가 개최되었습니다. 학생들은 다양한 주제로 프로젝트를 진행했으며, 우수 작품에 대해서는 상을 수여했습니다.'),
       ('금오공과대학교 대학원 신입생 모집 공고', '금오공과대학교 대학원에서는 새 학기 신입생 모집을 진행하고 있습니다. 지원 자격과 방법 등에 대해서는 대학 홈페이지에서 확인해주세요.'),
       ('금오공과대학교 산학협력단, AI 연구 센터 설립', '금오공과대학교 산학협력단은 최근 인공지능 분야에서 전문적인 연구를 진행하기 위해 AI 연구 센터를 설립하였습니다. 이를 통해 대학과 산업체 간의 협력이 강화될 것으로 기대됩니다.'),
       ('금오공과대학교 전자공학과, 로봇 공모전 수상', '금오공과대학교 전자공학과 학생들이 참여한 로봇 공모전에서 우수한 성적을 거두었습니다. 학생들은 협업을 통해 창의적인 로봇을 개발하였으며, 이를 통해 전공 실력을 향상시켰습니다.'),
       ('금오공과대학교 인문사회과학대학, 교내 대외협력 업무 추진', '금오공과대학교 인문사회과학대학은 다양한 대외협력 업무를 추진하고 있습니다. 이를 통해 학생들의 실무 경험을 쌓고, 산업체와의 연계를 강화하고자 합니다.');
       